{
  "backend/main.mo": "Motoko canister handling blob storage, access control, user profiles, and custom order submission with admin-only order retrieval.",
  "feature_evidence.json": "Feature evidence report mapping bouquet collection features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point setting metadata, icons, fonts, and root mount point for the React app.",
  "frontend/src/App.tsx": "Main React router setup defining routes for all collection and utility pages using TanStack Router.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with brand info, Instagram/email links, attribution, and dynamic caffeine.ai tracking URL.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper rendering TopNav, page content, and SiteFooter around all routes.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with logo, desktop links, and a toggleable mobile menu.",
  "frontend/src/components/Section.tsx": "Reusable Section and SectionHeader components providing layout spacing, animations, and consistent typography.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting and fetching custom orders using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with light/dark theme variables and custom animations.",
  "frontend/src/lib/catalogImageMap.ts": "Maps product categories to their corresponding image asset paths and provides helper access functions.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names with clsx and twMerge.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/BookmarkCollectionPage.tsx": "Renders the bookmark collection page with product image, pricing card, and feature grid.",
  "frontend/src/pages/BouquetCollectionPage.tsx": "Displays a grid of bouquet products with images, descriptions, and tiered or starting prices.",
  "frontend/src/pages/CustomizedCardCollectionPage.tsx": "Shows customized card offerings with pricing, sample image, and occasion categories.",
  "frontend/src/pages/CustomOrdersPage.tsx": "Provides a custom order form with file uploads and submits the data via a mutation hook.",
  "frontend/src/pages/FramesMemoryKeepsakesPage.tsx": "Renders a product grid for polaroid prints, books, and albums with descriptions and pricing options.",
  "frontend/src/pages/HandcraftedCuteEssentialsPage.tsx": "Displays a grid of cute handcrafted accessory images with a brief descriptive note.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring category navigation, hero branding, and value propositions.",
  "frontend/src/pages/PolaroidCollectionPage.tsx": "React page displaying polaroid print sizes and polaroid bouquet products using cards, sections, and mapped data arrays.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL or session-stored parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and plugins for the project’s UI styling.",
  "project_state.json": "Project state file detailing bouquet gallery requirements, design guidelines, image assets, and implemented features."
}