{
  "backend/main.mo": "Main canister logic handling user profiles, blob storage, access control, and custom order submission with admin‑restricted order retrieval.",
  "backend/migration.mo": "Migration module converting old custom order format to the new schema, adding new fields and mapping renamed ones.",
  "feature_evidence.json": "Report detailing implemented features, associated source files, components, and confidence levels for product updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their structure, purpose, and implemented features.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color tokens, themes, base styles, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, favicon assets, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for all product and collection pages using the shared site layout.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component showing brand info, Instagram and email links, metadata, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper combining TopNav, page content, and footer into the app’s main structure.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with logo, desktop links, and a mobile menu toggle.",
  "frontend/src/components/Section.tsx": "Reusable Section and SectionHeader components providing consistent spacing, animations, and typography.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for submitting and fetching custom orders using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, dark mode settings, animations, and global styles.",
  "frontend/src/lib/catalogImageMap.ts": "Centralized mappings and helper functions for catalog and product image paths.",
  "frontend/src/lib/utils.ts": "Utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/BookmarkCollectionPage.tsx": "Page displaying the bookmark collection with product image, pricing card, and feature list.",
  "frontend/src/pages/BouquetCollectionPage.tsx": "Displays bouquet types with images, tiers, and pricing, plus a separate pipe cleaner bouquet section.",
  "frontend/src/pages/CustomizedCardCollectionPage.tsx": "Shows customized card pricing, preview image, and occasion categories with icons.",
  "frontend/src/pages/CustomOrdersPage.tsx": "Provides a form for submitting custom orders with file uploads, validation, and mutation handling.",
  "frontend/src/pages/FramesMemoryKeepsakesPage.tsx": "Lists polaroid and album products with images, descriptions, and pricing options.",
  "frontend/src/pages/HandcraftedCuteEssentialsPage.tsx": "Renders a grid of cute essential item images with a brief handcrafted description.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring category navigation, tagline, and value propositions.",
  "frontend/src/pages/PolaroidCollectionPage.tsx": "Renders the Polaroid Collection page showing print sizes and bouquet products with pricing and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, container settings, and plugins.",
  "project_state.json": "Defines the project state, requirements, image editing rules, and existing feature records for the DESVA product website."
}