{
  "backend/main.mo": "Defines a CustomOrder type, stores orders in a list, and exposes submit and query endpoints with timestamp‑based sorting.",
  "feature_evidence.json": "Aggregates feature reports referencing frontend files, their purposes, and associated test IDs for build verification.",
  "frontend-file-summaries.txt": "Provides human-written summaries for all frontend components, pages, hooks, and utilities used in the project.",
  "frontend/index.css": "Tailwind CSS base setup defining OKLCH color variables, dark mode overrides, and global background/text styles.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, favicon assets, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router and maps all routes to pages within a SiteLayout wrapper.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with brand info, contact links, attribution, and dynamic year display.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper combining TopNav, page content, and SiteFooter into a full‑page structure.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive navigation bar with logo, desktop links, and a mobile menu toggle.",
  "frontend/src/components/Section.tsx": "Reusable Section and SectionHeader components providing spacing, animations, and typography utilities.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and refreshes the backend actor based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting custom orders and fetching all custom orders through an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles, theming variables, dark mode settings, and custom animations.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/pages/BookmarkCollectionPage.tsx": "Renders a bookmark collection page with pricing, descriptive text, and a feature grid.",
  "frontend/src/pages/BouquetCollectionPage.tsx": "Displays bouquet types with tiered pricing and a section for pipe cleaner bouquets.",
  "frontend/src/pages/CustomizedCardCollectionPage.tsx": "Displays customized event card offerings with pricing, description, and an occasions grid using icons and styled sections.",
  "frontend/src/pages/CustomOrdersPage.tsx": "Implements a custom order form with submission handling, success feedback, and Instagram CTA.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, brand visuals, category cards, and a 'why choose us' feature list.",
  "frontend/src/pages/PolaroidCollectionPage.tsx": "Shows polaroid product sizes with prices and descriptions in a styled grid layout.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for the project's design system.",
  "project_state.json": "Project metadata describing site structure, design goals, required features, and current implementation state."
}