{
  "kind": "build_request",
  "title": "Bouquet Collection: 6-card luxury grid with updated pricing, descriptions, and premium soft-white images",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Bouquet Collection page to present a single main section titled “Bouquet Collection” containing exactly 6 product cards in a clean, premium grid layout (6 items total), each showing: product image, product name, short description, and pricing details, matching the user-provided bouquet types and copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Create a separate main section titled “Bouquet Collection”.\n\nInside this Bouquet section, create 6 clear product divisions (6 columns or 6 product cards).\n\nEach division must display:\n\t•\tProduct Image (use assigned uploaded image)\n\t•\tProduct Name\n\t•\tShort Description\n\t•\tPricing Details\n\t•\tClean premium layout"
        ]
      },
      "acceptanceCriteria": [
        "/bouquets renders one Bouquet Collection section containing 6 product cards for: Ribbon Flower Bouquet, Artificial Flower Bouquet, Natural Flower Bouquet, Pipe Cleaner Flower Bouquet, Polaroid Bouquet, Customized Bouquet.",
        "Each card displays: image, name, short description, and pricing details (tiers or starting price as specified).",
        "Text and pricing match the user prompt exactly (including the Pipe Cleaner note text)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure bouquet card content matches the provided descriptions and pricing exactly:\n- Ribbon Flower Bouquet: Description “Handmade ribbon flower bouquet with elegant wrapping.” Pricing tiers: Normal ₹89, Premium ₹119\n- Artificial Flower Bouquet: Description “Long-lasting artificial flower bouquet with premium finish.” Pricing tiers: Normal ₹89, Premium ₹119\n- Natural Flower Bouquet: Description “Fresh natural flower bouquet arranged beautifully.” Pricing tiers: Normal ₹89, Premium ₹119\n- Pipe Cleaner Flower Bouquet: Pricing tiers: Normal ₹200, Premium ₹250, Customized Premium ₹300+ and include note: “Final price depends on customization.”\n- Polaroid Bouquet: Description “Creative bouquet designed using polaroid photo memories.” Pricing: Starting from ₹350\n- Customized Bouquet: Description “Fully customized bouquet designed according to theme and customer preferences.” Pricing: Starting from ₹550",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "🌸 1️⃣ Ribbon Flower Bouquet\n\nPricing:\n\t•\tNormal – ₹89\n\t•\tPremium – ₹119\n\nDescription:\nHandmade ribbon flower bouquet with elegant wrapping.\n\n⸻\n\n🌸 2️⃣ Artificial Flower Bouquet\n...\n🌸 6️⃣ Customized Bouquet\n...\nPricing:\n\t•\tStarting from ₹550\n\nDescription:\nFully customized bouquet designed according to theme and customer preferences."
        ]
      },
      "acceptanceCriteria": [
        "Prices displayed on the Bouquet Collection page match the prompt exactly (including ₹200/₹250/₹300+ for Pipe Cleaner, and Starting from ₹350/₹550 for Polaroid/Customized).",
        "The Pipe Cleaner card includes the note text exactly: “Final price depends on customization.”",
        "Each bouquet card includes its specific short description (not generic placeholder text like “Choose your preferred tier”)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the Bouquet Collection grid as a responsive, equal-spacing layout with a luxury boutique feel on a soft white / beige aesthetic background. The grid must be mobile responsive and use elegant typography consistent with a premium catalog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use a soft white aesthetic background and maintain a luxury boutique style.\n...\nLayout must be:\n\t•\tClean grid format\n\t•\tEqual spacing\n\t•\tElegant typography\n\t•\tMobile responsive\n\t•\tLuxury handmade boutique feel"
        ]
      },
      "acceptanceCriteria": [
        "Bouquet Collection section background is soft white/beige (not a colorful gradient).",
        "Grid is responsive (1 column on small screens; increases with breakpoints) and maintains equal spacing between cards.",
        "Card styling reads as premium (clean borders/shadows, consistent spacing/typography)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the 6 uploaded bouquet images as static frontend assets and update frontend image mappings so the Bouquet Collection cards use the assigned images in order (1st–6th) with the provided filenames: IMG_6954.jpeg, IMG_6959.jpeg, IMG_6960-5.jpeg, IMG_6958-5.jpeg, IMG_6967-5.jpeg, IMG_6966-5.jpeg.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The user has uploaded 6 image(s): IMG_6954.jpeg, IMG_6959.jpeg, IMG_6960-5.jpeg, IMG_6958-5.jpeg, IMG_6967-5.jpeg, IMG_6966-5.jpeg."
        ]
      },
      "acceptanceCriteria": [
        "The bouquet cards render images sourced from the new uploaded asset set (not older IMG_6957-1/IMG_6952-1/etc).",
        "Image-to-product assignment matches the prompt order: (1) Ribbon, (2) Artificial, (3) Natural, (4) Pipe Cleaner, (5) Polaroid Bouquet, (6) Customized Bouquet.",
        "No broken image links appear on /bouquets."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Generate and use premium-edited versions of all 6 bouquet images that preserve original product colors/design while replacing the background with soft white or beige, adding a subtle shadow, maintaining high resolution, and centering the product. Store generated images in frontend/public/assets/generated and ensure the Bouquet Collection uses these generated images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "For all bouquet images:\n\t•\tKeep original product colors\n\t•\tDo not alter product design\n\t•\tReplace background with soft white or beige aesthetic\n\t•\tAdd subtle shadow\n\t•\tMaintain high resolution\n\t•\tUse clean centered alignment\n\t•\tMake product look premium and professional"
        ]
      },
      "acceptanceCriteria": [
        "There are 6 generated bouquet images in frontend/public/assets/generated and the Bouquet Collection uses them (not the raw uploads).",
        "Generated images visibly have a soft white/beige background and subtle shadow, and the bouquet is centered without altering product colors/design.",
        "Generated images are high resolution and consistently sized for a uniform grid presentation."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Keep original product colors and do not alter product design in bouquet images; only adjust background and add subtle shadow.",
    "Store generated images as static assets under frontend/public/assets/generated; do not route image generation/serving through the backend."
  ],
  "nonGoals": [
    "Do not add checkout, payments, cart, or ordering flows beyond existing site behavior.",
    "Do not change backend canister logic (Motoko) for this request.",
    "Do not redesign other collection pages (Polaroid/Bookmarks/etc) except for shared image mapping changes needed to support the Bouquet Collection images."
  ],
  "imageRequirements": {
    "required": [
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6954_softwhite.dim_1600x1600.png)",
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6959_softwhite.dim_1600x1600.png)",
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6960-5_softwhite.dim_1600x1600.png)",
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6958-5_softwhite.dim_1600x1600.png)",
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6967-5_softwhite.dim_1600x1600.png)",
      "Premium centered bouquet product photo with soft white/beige background and subtle shadow (IMG_6966-5_softwhite.dim_1600x1600.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}